# St7GetResFileTime

Returns the integration time assigned to the specified result case in the custom result file; units are seconds.

long St7GetResFileTime(long uID, long CaseNum, double* Time)

Input Parameters

uID

Strand7 model file ID.

CaseNum

Result case number.

Output Parameters

Time

Integration time in seconds.